{"name":"Andrew's Brewing","city":"Lincolnville","state":"Maine","code":"4849","country":"United States","phone":"(207) 763-3305","website":"","type":"brewery","updated":"2010-07-22 20:00:20","description":"Andy Hazen is a workhorse of a brewer. From start to finish, he is a one-man operation. The former cabinetmaker is also a self-reliant Mainer through and through. He was originally an all-grain homebrewer who decided to take it to the next level when his friends expressed interest in his beers. He designed the 12-barrel brewing system himself and enlisted a local welder to help put it together. Hazen notes that when you live in Maine, you have to find some service to provide to others in order to survive. For him, brewing is the service he provides to his local community. Located in the rolling hills of Lincolnville, Maine, Andrew's is housed in a renovated farmhouse next to Hazen's home. Finding the brewery is more than half the battle. Have no fear, however, as everyone knows about Andrew's. Also, be aware that due to some thieving souls, the brewery no longer has any signage to announce its existence to the visiting public. The only indication that a brewery exists in the farmhouse are the occasional keg deliveries in Hazen's front yard. And Hazen hasn't been quick to replace the sign either. While he welcomes visitors, you have to remember to clear a path for the busy brewer. Like many other unsung small brewers, running his 5OO-barrel per year brewery is a seven day a week operation for Hazen. Watching Hazen run the brewery is a little like watching Willy Wonka run the Chocolate Factory. When I visit him during a bottling day, Hazen runs between the bottling line and the packaging supplies in a hurried yet methodical manner. He stands up bottles on the line, starts the machine, slides his way across the brewhouse to the packaging materials, and hand assembles the six-packs that will hold the soon-to-be bottled beer. Andrew's beer is straightforward, unassuming and entirely enjoyable. His product line includes the St. Nick Porter, the Northern Brown Ale, the English Pale Ale, and the summer seasonal Ruby's Golden Ale. A celebration of the Amarillo hop, Hazen's English Pale Ale is a delightfully balanced product that neither over or underwhelms the palate.  from beerscribe.com","address":[],"geo":{"accuracy":"RANGE_INTERPOLATED","lat":44.3516,"lon":-69.1401}}