{"name":"Barrel House Brewing Co.","city":"Cincinnati","state":"Ohio","code":"45214","country":"United States","phone":"513-421-2337","website":"http://www.barrelhouse.com","type":"brewery","updated":"2010-07-22 20:00:20","description":"Established as a brewpub in 1995 in the historic Over-The-Rhine neighborhood of Cincinnati, The BarrelHouse Brewing Company has since transitioned into a regionally distributed microbrewery offering an impressive selection of both innovative styles of ales and traditional lagers. Brewed and bottled in small batches with only honest ingredients, BarrelHouse beers are extremely fresh and exceptionally flavorful. Thank you for embracing our fiercely independent vision of a hand-crafted future for all! Operating as a brewpub from August 1995 until February 2005, The BarrelHouse Brewing Company recently relocated to our current location in the West End of downtown Cincinnati. We officially reopened with a completed expansion plan in April 2005. Our expansion included almost doubling our fermentation capacity as well as the addition of a brand new bottling line. Our first order of bottled beer hit Ohio area stores in June 2006 and we have subsequently begun to enter markets that were previously unavailable. The BarrelHouse Brewing Company brews on a 15 BBL brewhouse manufactured by Century. One BBL equals 31 gallons therefore; our beers are hand-crafted in 465 gallon batches. Our ales are ready after approximately fourteen days while our lagers are conditioned for upwards of six weeks. By brewing in small batches, our brewers are able to achieve an optimal level of quality control while creating a consistently flavorful product. While our brewing process is quite labor intensive, we believe that hand-crafting our beers sets us apart from the majority of breweries in the U.S. today. Our dedication is unparalleled and quite evident in the final packaged product.","address":["544B W. Liberty St."],"geo":{"accuracy":"RANGE_INTERPOLATED","lat":39.1136,"lon":-84.526}}