{"name":"Bavarian Barbarian Brewing Company","city":"Williamsport","state":"Pennsylvania","code":"17701","country":"United States","phone":"570.332.5050","website":"http://www.bavarianbarbarian.com","type":"brewery","updated":"2010-07-22 20:00:20","description":"Bavarian Barbarian Brewing Company is Williamsport's first production brewery since the 1950's. The brewery, which occupies 9,000 square feet at 429 W. 3rd St in Williamsport, Pennsylvania, was founded by Mike Hiller in July 2007.  Though a native of South Williamsport, Barbarian Chief, Mike Hiller, first entered the craft brewing industry in 1997 as an Account Services Associate for Legendary Distributors, Ltd., of Richmond, Virginia. After nearly a year of distributing beer, an opportunity arose for Mike to work as a brewer for Legend Brewing Company. Mike worked with five other brewers to perform duties at all levels of production including brewing, cellar work, cleaning and maintenance.  After nearly four years of service at Legend Brewing Company, Mike moved to Boston, MA, so his wife, Kira, could attend grad school. Tired of listening to him whine about how much he missed brewing, Kira gave him a home brewing kit as an anniversary gift. Mike began brewing whenever he could find the time. He developed the recipes for Hammerin' Ale, Headbangerz Brown Ale, Square Feet Wheat, Weldspatter I.P.A. and several other beers in five-gallon batches on his apartment's balcony.  Mike was also commissioned by friends and co-workers to brew beer for special occasions.  In fact, Square Feet Wheat was actually first brewed for an art gallery opening featuring works by the Barbarian's logo and label designer, Erick Thomas.  After reading Brewing Up a Business: Adventures in Entrepreneurship by Sam Calagione of Dogfish Head Brewery fame, Mike was inspired to start his own brewery. He spent eight months researching and writing a business plan. Another year was spent gathering support and revising his business plans. Thanks to the support of family, friends and other area businessmen who believed in Mike's dream, Bavarian Barbarian Brewing Company is now a reality.","address":["429 W. 3rd St"],"geo":{"accuracy":"RANGE_INTERPOLATED","lat":41.238,"lon":-77.0103}}