{"name":"Hop Henge Imperial IPA","abv":8.75,"ibu":0.0,"srm":0.0,"upc":0,"type":"beer","brewery_id":"deschutes_brewery","updated":"2010-07-22 20:00:20","description":"HOP HENGE IMPERIAL IPA – The Ultimate in Hop Innovation \r\n\r\nHop Henge Imperial IPA returns to the Bond Street Series line-up this April in extreme fashion. Staying true to the experimental nature of the series and the “never settle” philosophy of Deschutes, our brewers went back to the drawing board to create an amplified version of last year’s monument to hops.\r\n\r\nHead Brewer Brett Porter says, “This is a truly exciting and groundbreaking beer. We reformulated everything about the hop recipe to give Hop Henge an extraordinary aroma and flavor similar to a fresh hop beer.” In addition to the Cascade and Centennial hops, Deschutes Brewery is experimenting with a hop variety so new that it has yet to be named.\r\n\r\nThe team here at Bend Public House recommends Hop Henge as the perfect accompaniment for a variety of spicy foods, so be sure to have a bottle handy next time you make a batch of hot wings and go for the five alarm award. The high-octane hoppiness is a wildly refreshing antidote to a wide array of hot foods.\r\n\r\nLimited Availability April through June.\r\n\r\nDon’t miss this amazing hop experiment that is sure to leave your taste buds begging for more.\r\n\r\n-http://www.deschutesbrewery.com/Brews/Bond+Street+Series/default.aspx\r\n\r\nAvailable April through June.\r\n\r\nHop Henge I.P.A. was first brewed in 2006 as an agressive West Coast style I.P.A. In 2007, Hop Henge is going Imperial!  Several pounds of  Centennial, Cascade and Northern Brewer hops are in each barrel with a heavy dry-hop presence to top it off.  A blend of crystal, pale and caraston malts creates an overall biscuity characteristic that is dense and muscular, building the alcohol base to support the monstrous hop profile.\r\n\r\nLike the rest of the Bond Street Series, Hop Henge highlights the creativity and curiosity of our brewers.  Bolder than its English ancestors, with huge hops and a bitter finish, this IPA is no wallflower.\r\n\r\nAlcohol By Volume: 8.1%\r\n\t\r\n\r\nIBU 95\r\n\r\nWhen one of our brewers suggested we name our new IPA Hop Henge, he also came up with the idea of actually recreating Stonehenge, only with hop bales.  We were up for the challenge and even though the weather did not want to cooperate, we pulled it off and threw a party afterwards.\r\n\t\r\n\r\n\r\nphoto: chris mather\r\nRatings, Awards & Notables\r\n\r\nWorld's Best Strong Pale Ale (Imperial IPA)\r\n2007 World Beer Awards\r\n\r\nWorld's 50 Best Beers\r\n2006 International Beer Challenge\r\n\r\nGold Medal, 92 Points\r\n2006 World Beer Championships\r\n\r\nSilver Medal, India Pale Ale Category\r\n2006 Australian International Beer Awards\r\n\r\nModern Brewery Age, February 12, 2007\r\n5 out 5 stars \r\nHop Henge started its life as an India Pale Ale, but this year it was bumped up to “Imperial IPA” status, with a hefty dose of additional hops.\r\n“This one is lovely,” said taster Tom Conti. “They got it just right.”\r\nIt pours out a deep amber, with an appealing rocky head, and rich hop aroma wafting from the glass. “They sure dosed it with a lot of hops...[there’s] a lot of hop bitterness in the taste,” one taster observed.\r\nIn addition to the Imperial-level hopping, Hop Henge also boasts Imperial-level alcohol content, with 8.1% a.b.v.\r\nThis was the top-rated beer during its tasting session, and tasters had to dig deep for new superlatives to describe it. “This is a beautiful beer,” concluded taster Gregg Glaser. “Full of flavor and hops and malt and hops again.”\r\n“Not for the timid,” said taster Robert Lachman.\r\n\r\n-http://www.deschutesbrewery.com/BrewPub/OnTap/125352.aspx","style":"Imperial or Double India Pale Ale","category":"North American Ale"}