{"name":"Brutal Bitter","abv":6.5,"ibu":0.0,"srm":0.0,"upc":0,"type":"beer","brewery_id":"rogue_ales","updated":"2010-07-22 20:00:20","description":"An imperial bitter style using exotic traditional floor malts, citrus hoppy flavor, stupendous hop aroma. Hedonistic!\"Mellow Beer Emboldened by Hops,\" Elaine Louies article in the New York TimesDining Out Section, (March 24, 1999) announced the release of latest Rogue elixir to be bottled. The article states that \"The newest beer of Rogue Ales sounds more aggressive than it is. Brutal Bitter is actually full-bodied, deeply flavored, intensely hoppy brew. There is nothing brutal about the rich, deep, mellow taste. Its crackling but not sharp... This beer may raise eyebrows, but it wont pucker lips. The aftertaste is clean.\"\r\n\r\nRogue brewer John Maier describes his Brutal Bitter as a cross between a Very Extra Special Bitter and an Indian Pale Ale. Brutal Bitter was first brewed in 1996 for the 20th Anniversary of the Horse Brass Pub in Portland. Customer demand prompted Rogue to continue brewing Brutal for the Horse Brass as well as using it as Rogues premier pour at the 1998 Oregon Brewers Festival. At the 1999 SpringFest in Portland, Oregon, Brutal Bitter was unscientifically voted the Peoples Choice--it received twice as many votes as the runner-up.\r\n\r\nBrutal combines Oregon hops with English Malts. The Oregon grown Crystal hop is a triploid variety developed from the German Hallertau aroma hop variety with contributions from Cascade, Brewers Gold, and Early Green. Crystal is the only hop used in brewing Brutal and it provides a massive amount of aroma without dry-hopping. The English malts used are floor malted Pipkin (a mellow cross of Maris Otter and Warboys, from an English company called Beeston), Cara Vienna and Cara Wheat. Brutal Bitter is packaged in Rogues classic 22 ounce silk-screened bottle, 12-ounce 6-pack (new for 2005), and is available on draft.","style":"Extra Special Bitter","category":"British Ale"}